name: "ensemble_model3"
platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "text"
    data_type: TYPE_INT32
    dims: [ -1 ]
  }
]
input [
  {
    name: "volume"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
input [
  {
    name: "speed"
    data_type: TYPE_FP32
    dims: [ 1 ]
  }
]
output [
  {
    name: "outwav"
    data_type: TYPE_INT16
    dims: [ -1,1]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "am"
      model_version: 1
      input_map {
        key: "text"
        value: "text"
      }
      output_map {
        key: "elementwise_add_59"
        value: "mel"
      }
    },
    {
      model_name: "vocoder"
      model_version: 1
      input_map {
        key: "logmel"
        value: "mel"
      }
      output_map {
        key: "transpose_104.tmp_0"
        value: "v_wav"
      }
    },
    {
      model_name: "postpress"
      model_version: 1
      input_map {
        key: "input0"
        value: "v_wav"
      }
      input_map {
        key: "volume"
        value: "volume"
      }
      input_map {
        key: "speed"
        value: "speed"
      }
      output_map {
        key: "output0"
        value: "outwav"
      }
    }
  ]
}
